<!-- add-pr-comment:common_plan -->

# production/common Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_dashboard.emails[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "emails" {
      ~ dashboard_body = (sensitive value)
        id             = "Emails"
        # (3 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.route53-dns-failures-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.route53-dns-failures-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "route53-dns-failures-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ] -> null
      - alarm_description                     = "Alarm for Route53 DNS resolution failures exceeding threshold" -> null
      - alarm_name                            = "route53-dns-resolution-failures-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:296255494825:alarm:route53-dns-resolution-failures-warning" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "route53-dns-resolution-failures-warning" -> null
      - insufficient_data_actions             = [
          - "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ] -> null
      - metric_name                           = "Route53PublicDNSResolutionFailureCount" -> null
      - namespace                             = "Route53/PublicResolver" -> null
      - ok_actions                            = [
          - "arn:aws:sns:us-east-1:296255494825:alert-ok-us-east-1",
        ] -> null
      - period                                = 600 -> null
      - region                                = "us-east-1" -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 50 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.ses-daily-email-quota-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "ses-daily-email-quota-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "SES sends over the last 24 hours have reached 90% of the daily email quota"
      + alarm_name                            = "ses-daily-email-quota-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "Send"
      + namespace                             = "AWS/SES"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 86400
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2700000
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.ses-daily-email-quota-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "ses-daily-email-quota-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "SES sends over the last 24 hours have reached 70% of the daily email quota"
      + alarm_name                            = "ses-daily-email-quota-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "Send"
      + namespace                             = "AWS/SES"
      + period                                = 86400
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2100000
      + treat_missing_data                    = "notBreaching"
    }
  # aws_wafv2_regex_pattern_set.re_admin2 will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "re_admin2" {
        id          = "d2814ed4-6817-4fc1-9e7a-0b39ca8803cc"
        name        = "re_admin2"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (7 unchanged attributes hidden)
      - regular_expression {
          - regex_string = "/by-and-for-gc|/par-et-pour-gc|/newsletter-subscription|/known-issues|/problemes-connus|/accessibility-202512|/accessibilite-202512" -> null
        }
      + regular_expression {
          + regex_string = "/by-and-for-gc|/par-et-pour-gc|/newsletter-subscription|/known-issues|/problemes-connus|/accessibility-202512|/accessibilite-202512|/counting-text-messages|/compter-les-messages-texte"
        }
        # (1 unchanged block hidden)
    }
Plan: 2 to add, 2 to change, 1 to destroy.

# --- End of Plan 1 ---

```